/*

 산술 연산자
    (+, -, *, /, % )

    let a = 5;
    let b = 2;

    console.log(a+b)
    console.log(a-b)
    console.log(a*b)
    console.log(a/b)
    console.log(a%b)

 단항 산술 연산자 
    (+,-)
    (++,--)

    let a =1;
    a++
    console.log(a)// 2

 전위/후위 연산자
    ++a (전위 연산자 )
    a++ (후위 연산자 )
    
    let a = 5;
    console.log(++a) // 6
    a의 값을 더하고 출려하라 
    console.log(a++) // 6 -----> 6+1(console -> x)
    출력하고 a의 값을 더하라
    console.log(a) // 7

    => 전위 연산자는 해당 명령 블럭 내에서 다른 명령어를 실행하기 전에 
    후위 연산자는 해당 명령 블럭내에 다른 명령어를 실행하고 나서



    문자열 연결 연산자
        "안" + "녕" = "안녕"
        "안녕하세요" - "안녕" = NaN
        NaN + "a" = "NaNa" 
        1 + "2" = "12"
       (더하기 연산자에 한해서, 문자열이 포함되어있으면 연산값은 문자열로 연결 된다)


 할당 연산자 
    = 할당 ex) a = 5;
    += 자기 자신 요소에서 연산 ex) a += 1 -> a = a+1
    (*=, -= .....)
 우선순위연산자 
    10 * (2+2)=40 
    괄호씌우면우선연산됨

    -----------------------------------------------------------------------

    논리 연산자 


     비교 연산자


     비트 연산자 


     checklist
     1. 내가 가지고 있는 웹사이트의 모바일 반응형(대응)
     2.변수는 언제 사용하는지 -> 복잡한 연산...
     3.상수는 변수와 무엇이 다르고 언제 사용하는지
     4.var는 옛날 것
     5.예습

     ---------------------------------------------------------------------


     변수(값을 재사용할때! {협업})

*/

